Repository: 84000/data-translation-memory
Catalog: Toh_147-The_Teaching_on_the_Great_Compassion_of_the_Tathagata-v1.tmx
Source language: bo
Languages: en

source: མཁྱེན་ནས་ཆོས་སྟོན་མཛད་པ་འདི་ཡང་བདེ་གཤེགས་འཕྲིན་ལས་ཡིན་ཞེས་གསུངས། །
en: With this knowledge they teach the Dharma—such is said to be the activity of the sugatas.’

source: རིགས་ཀྱི་བུ་གཞན་ཡང་དེ་བཞིན་གཤེགས་པས་ཁམས་དུ་མ་དང་། ཁམས་སྣ་ཚོགས་ཅན་གྱི་འཇིག་རྟེན་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ། །
en: (4) “Son of noble family, the tathāgatas know, in accordance with reality, the worlds that are comprised of many and various elements.

source: ཁམས་གང་གིས་འཇིག་རྟེན་བསོད་ནམས་ཀྱི་འདུ་བྱེད་སོགས་པའི་ཁམས་དེ་ཡང་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ། །ཁམས་གང་གིས་བསོད་ནམས་མ་ཡིན་པའི་འདུ་བྱེད་སོགས་པ་དེ་ཡང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །ཁམས་གང་གིས་མི་གཡོ་བའི་འདུ་བྱེད་སོགས་པ་དེ་ཡང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །ཁམས་གང་གིས་འབྱུང་བའི་ཁམས་སུའང་འཇོག་པར་འགྱུར་བ་དེ་ཡང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know, in accordance with reality, which elements accumulate mundane virtuous conditioning, which elements accumulate nonvirtuous conditioning, which elements accumulate neutral conditioning, and which elements establish one in the element of deliverance.

source: གཞན་ཡང་དེ་བཞིན་གཤེགས་པས་མིག་གི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་དང་། མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “They know the element of the eye, the element of form, and the element of visual consciousness.

source: ནང་སྟོང་པ་ཉིད་དང་། ཕྱི་སྟོང་པ་ཉིད་དང་། ཕྱི་ནང་སྟོང་པ་ཉིད་དུ་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know them to be an inner emptiness, an outer emptiness, and an inner and outer emptiness, respectively.

source: རྣ་བའི་ཁམས་དང་། སྒྲའི་ཁམས་དང་། རྣ་བའི་རྣམ་པར་ཤེས་པའི་ཁམས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know the element of the ear, the element of sound, and the element of auditory consciousness.

source: སྣའི་ཁམས་དང་། དྲིའི་ཁམས་དང་། སྣའི་རྣམ་པར་ཤེས་པའི་ཁམས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know the element of the nose, the element of smell, and the element of olfactory consciousness.

source: ལྕེའི་ཁམས་དང་། རོའི་ཁམས་དང་། ལྕེའི་རྣམ་པར་ཤེས་པའི་ཁམས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know the element of the tongue, the element of taste, and the element of the consciousness of taste.

source: ལུས་ཀྱི་ཁམས་དང་། རེག་བྱའི་ཁམས་དང་། ལུས་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know the element of the body, the element of the tactile, and the element of tactile consciousness.

source: ཡིད་ཀྱི་ཁམས་དང་། ཆོས་ཀྱི་ཁམས་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know the element of the mind, the element of phenomena, and the element of mental consciousness.

source: སའི་ཁམས་དང་། ཆུའི་ཁམས་དང་། མེའི་ཁམས་དང་། རླུང་གི་ཁམས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know the elements of earth, water, fire, and wind.

source: ནམ་མཁའི་ཁམས་ཇི་ལྟ་བ་དེ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know them to be just like the element of space.

source: འདོད་པའི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་དང་། གཟུགས་མེད་པའི་ཁམས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “They know the desire realm, the form realm, and the formless realm.

source: ཀུན་ཏུ་རྟོག་པ་ལས་བྱུང་བར་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know them to originate in false imagining.

source: འདུས་བྱས་ཀྱི་ཁམས་ནི་མངོན་པར་འདུ་བྱེད་པའི་མཚན་ཉིད་དུ་རབ་ཏུ་མཁྱེན་ཏོ། །འདུས་མ་བྱས་ཀྱི་ཁམས་ནི་མངོན་པར་འདུ་མི་བྱེད་པའི་མཚན་ཉིད་དུ་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know conditioned elements to be fabricated and unconditioned elements to be unfabricated.

source: ཀུན་ནས་ཉོན་མོངས་པའི་ཁམས་ནི་གློ་བུར་གྱི་ཉོན་མོངས་པའི་མཚན་ཉིད་དུ་རབ་ཏུ་མཁྱེན་ཏོ། །རྣམ་པར་བྱང་བའི་ཁམས་ནི་རང་བཞིན་གྱིས་འོད་གསལ་བའི་མཚན་ཉིད་དུ་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know that the elements of pollution are characterized by adventitious afflictive emotion and that the elements of purification are characterized by natural luminosity.

source: འཁོར་བའི་ཁམས་ནི་ཚུལ་བཞིན་མ་ཡིན་པ་མ་རིག་པའི་མཚན་ཉིད་དུ་རབ་ཏུ་མཁྱེན་ཏོ། །མྱ་ངན་ལས་འདས་པའི་དབྱིངས་ནི་ཚུལ་བཞིན་རིག་པའི་མཚན་ཉིད་དུ་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know that the realm of saṃsāra is characterized by incorrect ignorance and that the sphere of nirvāṇa is characterized by correct knowing.

source: དེ་ལྟར་ན་འཇིག་རྟེན་གནས་པའི་ཁམས་གང་ཡིན་པ་དང་། རབ་ཏུ་གནས་པའི་ཁམས་གང་ཡིན་པ་དང་། རྗེས་སུ་ཁྲིད་པའི་ཁམས་གང་ཡིན་པ་དང་། ཐོགས་པའི་ཁམས་གང་ཡིན་པ་དང་།
en: “In this way, the tathāgatas fully understand which elements establish the world, which elements fully establish it, which elements facilitate, and which elements obstruct.

source: སྦྱོར་བའི་ཁམས་གང་ཡིན་པ་དང་། བསམ་པའི་ཁམས་གང་ཡིན་པ་དང་། ངེས་པར་སེམས་པའི་ཁམས་གང་ཡིན་པ་དང་། རྟེན་པའི་ཁམས་གང་ཡིན་པ་དེ་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know which elements belong to engagement, which belong to reflection, which belong to determination, and which elements are supports.

source: འདི་ནི་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པའི་འཕྲིན་ལས་བཞི་པའོ། །
en: This is the fourth tathāgata activity of the tathāgatas.

source: མི་ཡི་སེང་གེ་ཁམས་རྣམས་ཀུན་གྱི་ཚུལ་ལ་མཁས། །
en: “ ‘The lions among humans are skilled in the ways of all the elements.

source: གང་དུ་གང་གི་ཁམས་ནི་ཅི་འདྲ་འཇུག་པ་དང་། །
en: Which elements are engaged where and in what ways

source: ཁམས་གང་དགེ་བ་རྒྱ་ཆེན་ཀུན་དུ་འབྱུང་བྱེད་པ། །
en: And which elements are the source of extensive virtue.

source: དེ་ཀུན་བདེ་བར་གཤེགས་པས་མ་ལུས་རབ་མཁྱེན་ཏོ། །
en: “ ‘With their great insight, the sugatas know these elements:

source: བསོད་ནམས་བསོད་ནམས་མིན་དང་མི་གཡོ་རྒྱུས་བྱུང་མྱོང་། །
en: The experiences that propel merit, nonmerit, and neutrality,

source: གང་གིས་འབྱུང་བ་ཐོབ་པར་འགྱུར་བ་ཞི་བའི་ཁམས། །
en: And the element of peace that brings the attainment of deliverance

source: ཁམས་གང་གནས་ནས་ཁམས་ལས་རྣམ་པར་གྲོལ་འགྱུར་བ། །
en: And that, when established, brings liberation from the elements.

source: ཁམས་དེ་ཤེས་རབ་ཆེན་པོ་བདེ་བར་གཤེགས་པས་མཁྱེན། །
en: The sugatas know without exception

source: མིག་གི་ཁམས་དང་དེ་བཞིན་གཟུགས་དང་ཡིད་ཀྱི་ཁམས། །རང་བཞིན་སྟོང་པར་རྒྱལ་བས་སྤྱོད་པའི་བདག་ཉིད་མཁྱེན། །
en: “ ‘Knowing the elements of the eye, form, and mind to be naturally empty Is the essential conduct of the victors.

source: དེ་བཞིན་རྣ་བ་སྣ་དང་ལྕེ་དང་དེ་བཞིན་ལུས། །
en: Likewise, the elements of the ear, nose, tongue, and body,

source: ཡིད་དང་ཆོས་ཀྱི་ཁམས་ཀྱང་རྟག་ཏུ་སྟོང་པར་མཁྱེན། །
en: And the elements of the mind and phenomena, are known to be perpetually empty.

source: ཆུ་དང་མེ་དང་ས་དང་རླུང་གི་ཁམས་འདི་དག །ནམ་མཁའ་མཉམ་པར་མི་ཡི་སེང་གེས་རབ་ཏུ་མཁྱེན། །
en: “ ‘The lions among humans know The elements of water, fire, earth, and air to be like space.

source: འདོད་པ་དང་ནི་གཟུགས་དང་གཟུགས་མེད་ཁམས་འདི་དག །ཡོངས་སུ་རྟོག་ལས་ཡང་དག་བྱུང་བར་མ་ལུས་མཁྱེན། །
en: They know without exception that the realms of desire, form, and formlessness Emerge from conceptuality.

source: ཉོན་མོངས་ཁམས་ནི་རྒྱལ་བས་རང་བཞིན་མེད་པར་མཁྱེན། །
en: “ ‘The victors know the elements of pollution to lack a true nature.

source: རྣམ་བྱང་རང་བཞིན་འདྲ་བར་བདེ་བར་གཤེགས་པས་མཁྱེན། །
en: The sugatas know the elements of purification to be like this as well.

source: མི་མཁས་དག་གིས་འཁོར་བ་རྟག་ཏུ་འདུས་བྱས་དང་། །
en: The unskillful go on creating saṃsāra,

source: མྱ་ངན་འདས་པ་གང་ལ་མཚན་ཉིད་གསུམ་མེད་དང་། །
en: While nirvāṇa lacks the three characteristics of the conditioned.

source: ཁམས་གང་མི་དགེ་བས་ནི་འཇུག་པའི་མཚན་ཉིད་དང་། །
en: “ ‘Some elements are characterized by being engaged through nonvirtue,

source: གང་ཡང་དགེ་བས་འཇུག་པ་ཐམས་ཅད་གཅོད་པ་དང་། །
en: While others terminate all forms of engagement by means of virtue.

source: སྣ་ཚོགས་ཁམས་དང་དུ་མའི་ཁམས་ཅན་འཇིག་རྟེན་འདི། །སངས་རྒྱས་མཁྱེན་ཀྱང་
en: Though the buddhas understand this world comprised of various and manifold elements,

source: ངས་མཁྱེན་སྙམ་དུ་རློམ་སེམས་མེད། །
en: They are not conceited, thinking, “I know!”

source: ནམ་མཁའ་ཇི་ལྟ་བཞིན་དུ་མཐའ་ཡས་ཕྱོགས་རྣམས་ཀྱི། །ཁམས་རྣམས་དེ་བཞིན་མི་ཡི་སེང་གེས་རབ་ཏུ་མཁྱེན། །
en: “ ‘These lions among humans fully understand the elements, Which are limitless like space.

source: རྒྱལ་བའི་ཡེ་ཤེས་དམ་པ་དེ་ནི་ཐུག་པ་མེད། །
en: The sacred wisdom of the victors is unobstructed—

source: དེ་ཡི་མཐའ་ནི་འགྲོ་བ་རྣམས་ཀྱིས་ཤེས་མི་ནུས། །
en: Beings are unable to fathom its range.

source: འདི་ནི་སྐྱོབ་པ་རྡུལ་མེད་རྣམས་ཀྱི་འཕྲིན་ལས་བཞི། །
en: “ ‘This is the fourth activity of the pure protectors.

source: དེ་ཡིས་སེམས་ཅན་འདུལ་བའི་ཁམས་རྣམས་ཆོ་ག་མཁྱེན། །
en: They know the procedure in terms of the elements for taming beings.

source: གང་དག་ལས་ལེགས་བྱས་པས་དུལ་གྱུར་དེ་དག་ལ། །
en: In the process of taming them, through the proper performance of acts,

source: འཁྲུལ་པ་བརྒྱ་ལམ་ན་ཡང་ནམ་ཡང་མི་འབྱུང་ངོ་། །
en: Even though there exist myriad delusions, these never occur to them.’

source: རིགས་ཀྱི་བུ་གཞན་ཡང་དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་གཞན་དག་དང་། གང་ཟག་གཞན་རྣམས་ཀྱི་དབང་པོའི་རིམ་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ། །རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པས་ཇི་ལྟར་སེམས་ཅན་གཞན་དག་དང་།
en: (5) “Son of noble family, the tathāgatas know, in accordance with reality, the levels of the faculties of other beings and individuals.

source: གང་ཟག་གཞན་རྣམས་ཀྱི་དབང་པོའི་རིམ་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: You may ask, how do they know them in accordance with reality?

source: རིགས་ཀྱི་བུ་འདི་ལ་དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་དབང་པོ་རྟུལ་པོ་རྣམས་ཀྱང་སེམས་ཅན་དབང་པོ་རྟུལ་པོར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Son of noble family, they know, in accordance with reality, which beings are less gifted.

source: དེ་བཞིན་དུ་དབང་པོ་འབྲིང་ཡང་རབ་ཏུ་མཁྱེན་ཏོ། །དབང་པོ་རྣོ་བ་ཡང་རབ་ཏུ་མཁྱེན་ཏོ། །དབང་པོ་ཁྱད་པར་དུ་འཕགས་པ་ཡང་རབ་ཏུ་མཁྱེན་ཏོ། །དབང་པོ་དམན་པ་ཡང་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Likewise, they know whose faculties are average, whose are sharp, whose are extraordinary, and whose are poor.

source: ཡོངས་སུ་རྟོག་པའི་དབང་པོ་ཇི་ལྟ་བུས་མཐར་ཕྱིན་པའི་འདོད་ཆགས་སྐྱེ་བ་དང་། མཐར་ཕྱིན་པའི་ཞེ་སྡང་སྐྱེ་བ་དང་། མཐར་ཕྱིན་པའི་གཏི་མུག་སྐྱེ་བ་དེའང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “They know how consummate attachment, aversion, and delusion arise from the dominant influence of conceptuality.

source: ཡོངས་སུ་རྟོག་པའི་དབང་པོ་ཇི་ལྟ་བུས་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་བཅོས་མ་སྐྱེ་བ་དེ་ཡང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know how contrived attachment, aversion, and delusion arise from the dominant influence of conceptuality.

source: ཡོངས་སུ་རྟོག་པའི་དབང་པོ་ཇི་ལྟ་བུས་སྣྲེལ་ཞིའི་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་སྐྱེ་བ་དེ་ཡང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know how perverted attachment, aversion, and delusion arise from the dominant influence of conceptuality.

source: ཡོངས་སུ་རྟོག་པའི་དབང་པོ་ཇི་ལྟ་བུས་ཚར་བཅད་ཅིང་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་སྐྱེ་བ་དེ་ཡང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know how destructive attachment, aversion, and delusion arise from the dominant influence of conceptuality.

source: ཡོངས་སུ་རྟོག་པའི་དབང་པོ་ཇི་ལྟ་བུས་དབང་པོ་གང་དག་དགེ་བའི་རྒྱུ་ལས་བྱུང་བ་དང་། དབང་པོ་གང་དག་མི་དགེ་བའི་རྒྱུ་ལས་བྱུང་བ་དང་། དབང་པོ་གང་དག་མི་གཡོ་བའི་རྒྱུ་ལས་བྱུང་བ་དང་། དབང་པོ་གང་དག་འབྱུང་བའི་རྒྱུ་ལས་བྱུང་བ་དེ་དག་ཐམས་ཅད་ཀྱང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: The tathāgatas know comprehensively how, from the dominant influence of conceptuality, some faculties originate from virtuous causes, some from nonvirtuous causes, some from neutral causes, and others from the causes of deliverance.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་དེ་བཞིན་གཤེགས་པས་མིག་གི་དབང་པོ་རབ་ཏུ་མཁྱེན་ཏོ། །རྣ་བའི་དབང་པོ་དང་། སྣའི་དབང་པོ་དང་། ལྕེའི་དབང་པོ་དང་། ལུས་ཀྱི་དབང་པོ་དང་། ཡིད་ཀྱི་དབང་པོ་དང་།
en: “Moreover, son of noble family, the tathāgatas know the sense faculties of the eyes, ears, nose, tongue, body, and mind.

source: ཕོའི་དབང་པོ་དང་། མོའི་དབང་པོ་དང་། སྲོག་གི་དབང་པོ་དང་།
en: They know the male faculty, the female faculty, and the vital force.

source: བདེ་བའི་དབང་པོ་དང་། སྡུག་བསྔལ་གྱི་དབང་པོ་དང་། ཡིད་བདེ་བའི་དབང་པོ་དང་། ཡིད་མི་བདེ་བའི་དབང་པོ་དང་། བཏང་སྙོམས་ཀྱི་དབང་པོ་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They understand the propensity for physical pleasure and pain, mental joy and grief, and equanimity.

source: དད་པའི་དབང་པོ་དང་། བརྩོན་འགྲུས་ཀྱི་དབང་པོ་དང་། དྲན་པའི་དབང་པོ་དང་། ཏིང་ངེ་འཛིན་གྱི་དབང་པོ་དང་། ཤེས་རབ་ཀྱི་དབང་པོ་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know the spiritual faculties of faith, vigor, mindfulness, absorption, and insight.

source: མི་ཤེས་པ་ཀུན་ཤེས་པར་བྱེད་པའི་དབང་པོ་དང་། ཀུན་ཤེས་པའི་དབང་པོ་དང་། ཀུན་ཤེས་པ་དང་ལྡན་པའི་དབང་པོ་རབ་ཏུ་མཁྱེན་ཏེ། །
en: They know the faculty that changes unknowing into omniscience, the faculty of omniscience, and the faculty endowed with omniscience.

source: དབང་པོ་གང་མིག་གི་དབང་པོའི་རྒྱུ་ལས་བྱུང་ལ་རྣ་བའི་དབང་པོ་ལ་གནས་པར་གྱུར་ཏེ། སྣ་དང་། ལྕེ་དང་། ལུས་ཀྱི་དབང་པོ་ལ་མ་ཡིན་པ་དེའང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: The tathāgatas understand which capacity caused by the sense power of the eyes will transform into a sense power for the ear, rather than into a sense power for the nose, tongue, or body.

source: དབང་པོ་གང་རྣ་བའི་དབང་པོའི་རྒྱུ་ལས་བྱུང་ལ་སྣའི་དབང་པོ་ལ་གནས་པར་འགྱུར་བ་དང་། དབང་པོ་གང་སྣའི་དབང་པོའི་རྒྱུ་ལས་བྱུང་ལ་ལྕེའི་དབང་པོ་ལ་གནས་པར་འགྱུར་བ་དང་། དབང་པོ་གང་ལྕེའི་དབང་པོའི་རྒྱུ་ལས་བྱུང་ལ་ལུས་ཀྱི་དབང་པོ་ལ་གནས་པར་འགྱུར་བ་དང་། དབང་པོ་གང་ལུས་ཀྱི་དབང་པོའི་རྒྱུ་ལས་བྱུང་ལ་མིག་གི་དབང་པོ་ལ་གནས་པར་འགྱུར་བ་དེ་ཡང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They understand which capacity caused by the sense power of the ear will transform into a sense power for the nose, which capacity caused by the sense power of the nose will transform into a sense power for the tongue, which capacity caused by the sense power of the tongue will transform into a sense power for the body, and which capacity caused by the sense power of the body will transform into a sense power for the eye.

source: སེམས་ཅན་གང་སྦྱིན་པའི་དབང་པོ་ཅན་ཡིན་ལ་དེ་ཡང་ཚུལ་ཁྲིམས་ལ་སྦྱོར་བ་དེ་ལ་དེ་བཞིན་གཤེགས་པས་དབང་པོ་མཆོག་དང་མཆོག་མ་ཡིན་པ་མཁྱེན་པས་སྦྱིན་པའི་གཏམ་སྟོན་ཏོ། །
en: “To people who are capable of generosity and who apply themselves to moral conduct, the tathāgatas, understanding the range of capacities, give discourses on generosity.

source: སེམས་ཅན་གང་ཚུལ་ཁྲིམས་ཀྱི་དབང་པོ་ཅན་ཡིན་ལ་དེ་ཡང་སྦྱིན་པ་ལ་སྦྱོར་བ་དེ་ལ་དེ་བཞིན་གཤེགས་པས་དབང་པོ་མཆོག་དང་མཆོག་མ་ཡིན་པ་མཁྱེན་པས་ཚུལ་ཁྲིམས་ཀྱི་གཏམ་སྟོན་ཏོ། །
en: To people who are capable of moral conduct and who apply themselves to generosity, the tathāgatas, understanding the range of capacities, give discourses on moral conduct.

source: སེམས་ཅན་གང་བཟོད་པའི་དབང་པོ་ཅན་ཡིན་ལ་དེའང་བརྩོན་འགྲུས་ལ་སྦྱོར་བ་དེ་ལ་དེ་བཞིན་གཤེགས་པས་དབང་པོ་མཆོག་དང་མཆོག་མ་ཡིན་པ་མཁྱེན་པས་བཟོད་པའི་གཏམ་སྟོན་ཏོ། །
en: To people who have the capacity for patience and who apply themselves to vigor, the tathāgatas, understanding the range of capacities, give discourses on patience.

source: སེམས་ཅན་གང་བརྩོན་འགྲུས་ཀྱི་དབང་པོ་ཅན་ཡིན་ལ་དེའང་བཟོད་པ་ལ་སྦྱོར་བ་དེ་ལ་དེ་བཞིན་གཤེགས་པས་དབང་པོ་མཆོག་དང་མཆོག་མ་ཡིན་པ་མཁྱེན་པས་བརྩོན་འགྲུས་ཀྱི་གཏམ་སྟོན་ཏོ། །
en: To people who are capable of vigor and who apply themselves to patience, the tathāgatas, understanding the range of capacities, give discourses on vigor.

source: སེམས་ཅན་གང་བསམ་གཏན་གྱི་དབང་པོ་ཅན་ཡིན་ལ་དེའང་ཤེས་རབ་ལ་སྦྱོར་བ་དེ་ལ་དེ་བཞིན་གཤེགས་པས་དབང་པོ་མཆོག་དང་མཆོག་མ་ཡིན་པ་མཁྱེན་པས་བསམ་གཏན་གྱི་གཏམ་སྟོན་ཏོ། །
en: To people who have the capacity for concentration and who apply themselves to insight, the tathāgatas, understanding the range of capacities, give discourses on concentration.

source: སེམས་ཅན་གང་ཤེས་རབ་ཀྱི་དབང་པོ་ཅན་ཡིན་ལ་དེའང་བསམ་གཏན་ལ་སྦྱོར་བ་དེ་ལ་དེ་བཞིན་གཤེགས་པས་དབང་པོ་མཆོག་དང་མཆོག་མ་ཡིན་པ་མཁྱེན་པས་ཤེས་རབ་ཀྱི་གཏམ་སྟོན་ཏོ། །
en: To people who have the capacity for insight and who apply themselves to concentration, the tathāgatas, understanding the range of capacities, give discourses on insight.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་ཐམས་ཅད་ལ་ཡང་རྒྱས་པར་ཁོང་དུ་ཆུད་པར་བྱའོ། །
en: Likewise, all factors of awakening should be comprehended in detail.

source: སེམས་ཅན་གང་ཉན་ཐོས་ཀྱི་ཐེག་པའི་དབང་པོ་ཅན་ཡིན་ལ་དེའང་རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལ་སྦྱོར་བ་དེ་ལ་དེ་བཞིན་གཤེགས་པས་དབང་པོ་མཆོག་དང་མཆོག་མ་ཡིན་པ་མཁྱེན་པས་ཉན་ཐོས་ཀྱི་ཐེག་པའི་གཏམ་སྟོན་ཏོ། །
en: “To people who have the capacity for the Śrāvaka Vehicle but apply themselves to the Pratyekabuddha Vehicle, the tathāgatas, understanding the range of capacities, give discourses on the Śrāvaka Vehicle.

source: སེམས་ཅན་གང་རང་སངས་རྒྱས་ཀྱི་ཐེག་པའི་དབང་པོ་ཅན་ཡིན་ལ་དེའང་ཉན་ཐོས་ཀྱི་ཐེག་པ་ལ་སྦྱོར་བ་དེ་ལ་དེ་བཞིན་གཤེགས་པས་དབང་པོ་མཆོག་དང་མཆོག་མ་ཡིན་པ་མཁྱེན་པས་རང་སངས་རྒྱས་ཀྱི་ཐེག་པའི་གཏམ་སྟོན་ཏོ། །
en: To people who have the capacity for the Pratyekabuddha Vehicle but apply themselves to the Śrāvaka Vehicle, the tathāgatas, understanding the range of capacities, give discourses on the Pratyekabuddha Vehicle.

source: སེམས་ཅན་གང་ཐེག་པ་ཆེན་པོའི་དབང་པོ་ཅན་ཡིན་ལ་དེའང་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལ་སྦྱོར་བ་དེ་ལ་དེ་བཞིན་གཤེགས་པས་དབང་པོ་མཆོག་དང་མཆོག་མ་ཡིན་པ་མཁྱེན་པས་ཐེག་པ་ཆེན་པོའི་གཏམ་སྟོན་ཏོ། །
en: To people who have the capacity for the Great Vehicle but apply themselves to the Śrāvaka Vehicle and the Pratyekabuddha Vehicle, the tathāgatas, understanding the range of capacities, give discourses on the Great Vehicle.

source: སེམས་ཅན་གང་ཐ་མའི་དབང་པོ་ཅན་ཡིན་ལ་དེའང་ཐེག་པ་ཆེན་པོ་ལ་སྦྱོར་བ་དེ་ལ་དེ་བཞིན་གཤེགས་པས་དབང་པོ་མཆོག་དང་མཆོག་མ་ཡིན་པ་མཁྱེན་པས་ཐ་མའི་གཏམ་སྟོན་ཏོ། །
en: To people of the highest capacity who apply themselves to the Great Vehicle, the tathāgatas, understanding the range of capacities, give the final discourses.

source: སེམས་ཅན་སྐལ་བ་མེད་པའི་དབང་པོ་ཅན་སྐལ་བ་མེད་པར་སྣང་བ་དེ་དག་དེ་བཞིན་གཤེགས་པས་སྣོད་མ་ཡིན་པར་རིག་ནས་བཏང་སྙོམས་སུ་འཇོག་གོ། །
en: “When the tathāgatas know that those who are subject to a lack of fortune and who appear unfortunate are not receptive, they remain in equanimity.

source: སེམས་ཅན་སྐལ་བ་ཡོད་པའི་དབང་པོ་ཅན་སྐལ་བ་ཡོད་པར་སྣང་བ་དག་ལ་དེ་བཞིན་གཤེགས་པས་སྐལ་བ་ཡོད་པར་རིག་ནས་རི་མོར་བྱས་ཤིང་ཆོས་སྟོན་ཏེ།
en: When the tathāgatas know that those who have the power of good fortune and who appear fortunate are worthy, they teach them the Dharma as they are venerated by them.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབང་པོ་ཡོངས་སུ་སྨིན་པ་རྣམས་ཀྱང་རབ་ཏུ་མཁྱེན།
en: “Son of noble family, in this way the tathāgatas know the developed and the undeveloped capacities of all sentient beings.

source: དབང་པོ་ཡོངས་སུ་མ་སྨིན་པ་རྣམས་ཀྱང་རབ་ཏུ་མཁྱེན། འབྱུང་བ་མ་ཡིན་པའི་དབང་པོ་རྣམས་ཀྱང་རབ་ཏུ་མཁྱེན།
en: They know the capacities that have not yet emerged as well as those that have emerged.

source: འབྱུང་བ་དང་བཅས་པའི་དབང་པོ་རྣམས་ཀྱང་རབ་ཏུ་མཁྱེན་ཏེ། སེམས་ཅན་གྱི་དབང་པོའི་རྣམ་པ་གང་ཡིན་པ་དང་། སྦྱོར་བ་གང་ཡིན་པ་དང་། བསམ་པ་གང་ཡིན་པ་དང་། གང་གི་རྒྱུ་ལས་བྱུང་བ་དང་། རྐྱེན་གང་ཡིན་པ་དང་། དམིགས་པ་གང་ཡིན་པ་དང་། རྒྱུ་འཐུན་པ་གང་ཡིན་པ་དང་། སེམས་ཅན་གྱི་དབང་པོའི་མཐའ་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏེ
en: The tathāgatas know in accordance with reality the capacities of beings, their aspects, their applications, their intentions, the causes from which they arise, their conditions, their reference points, their concordant causes, and their limits.

source: འདི་ནི་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པའི་འཕྲིན་ལས་ལྔ་པའོ། །
en: This is the fifth tathāgata activity of the tathāgatas.

source: གང་ཞིག་དབང་པོ་ཤེས་པའི་ཕ་རོལ་སོན་པ་སེམས་ཅན་བསམ་པ་རྣམས་ལ་མཁས། །
en: “ ‘With transcendent knowledge of faculties, they are wise regarding the intentions of beings.

source: གང་གི་དབང་པོའི་སྤྱོད་པ་ཅི་འདྲར་གྱུར་པ་ཐམས་ཅད་རྒྱལ་བས་རབ་ཏུ་མཁྱེན། །
en: The victors know well how beings’ conduct accords with their faculties.

source: རྒྱལ་བ་དབང་པོ་ཁྱད་པར་ཅན་དང་འབྲིང་དང་ཐ་མའི་ཆོ་ག་མཁྱེན་གྱུར་ཏེ། །
en: The victors know the methods for those of exceptional, average, or poor faculties.

source: གང་གིས་འགྲོ་བ་གྲོལ་བྱེད་མཚུངས་པ་མེད་པའི་ལས་འདི་ཁྱད་པར་འཕགས་པ་ཡིན། །
en: Their incomparable deeds for liberating beings are outstanding.

source: གང་གིས་མཐར་ཕྱིན་པ་ཡི་ཉོན་མོངས་གྱུར་དང་གང་གིས་བཅོས་པར་གྱུར་པ་དང་། །དབང་པོ་གང་གིས་གསོག་ཏུ་གྱུར་པ་དང་ནི་གང་གིས་སྣྲེལ་ཞིར་གྱུར་པ་དང་། །
en: “ ‘They know the faculties by which afflictive emotions are consummated, contrived, Accumulated, and perverted.

source: ཉོན་མོངས་པ་དག་ཚར་གཅོད་འགྱུར་དང་དགེ་བའི་དབང་པོ་དང་ནི་མི་གཡོ་དང་། །དེ་བཞིན་མི་དགེ་བ་དང་གཞན་ཡང་གྲོལ་བར་འགྱུར་བ་དག་ཀྱང་རབ་ཏུ་མཁྱེན། །
en: They know the faculties of destructive afflictive emotions and those of virtue, Those that are neutral, those that are nonvirtuous, and those that are liberating.

source: གང་གིས་མིག་དང་ཡིད་དང་ཕོ་མོ་སྲོག་གི་དབང་པོ་དང་ནི་བདེ་བ་དང་། །སྡུག་བསྔལ་དང་ནི་ཡིད་བདེ་བ་དང་གང་གིས་ཡིད་མི་བདེ་བར་འགྱུར་བ་དང་། །གང་གིས་བཏང་སྙོམས་དད་དང་བརྩོན་འགྲུས་དྲན་དང་ཤེས་རབ་དེ་བཞིན་རྩེ་གཅིག་འགྱུར། །ཀུན་ཤེས་བྱེད་དང་ཀུན་ཤེས་དབང་པོའི་ཆོ་ག་དང་ནི་གྲོལ་བའི་དབང་པོ་གང་ཡིན་མཁྱེན། །
en: “ ‘They understand the sense faculties from the eye to the mind, the male and female faculties, The vital force, the propensities for pleasure and pain, joy, grief, and equanimity, The spiritual faculties of faith, vigor, mindfulness, insight, and one-pointedness, The method for the faculties for omniscience and for making all known, and the faculty for liberation.

source: མིག་གི་རྒྱུ་ལས་བྱུང་ལ་རྣ་བར་གནས་པར་བྱེད་ཀྱི་སྣ་དང་ལྕེ་ལ་མིན། །
en: “ ‘They know what occurs due to the cause of the eye and is made present to the ear rather than to the nose and the tongue,

source: ལུས་ཀྱི་བར་གྱི་རྒྱུ་ལས་བྱུང་བར་གྱུར་ལ་དེ་ཡང་མིག་ལ་གནས་པ་དང་། །
en: And what occurs due to causes up to the body and in turn is present to the eye.

source: སྦྱིན་པའི་དབང་པོ་ཡིན་ལ་ཚུལ་ཁྲིམས་སྣང་བའི་མི་དེ་ལ་ནི་སྦྱིན་པའི་གཏམ། །
en: To people with the capacity for generosity who exemplify moral conduct they give talks on generosity.

source: ཚུལ་ཁྲིམས་དབང་པོ་ཡིན་ལ་སྦྱིན་པའི་སྣང་བའི་མི་དེ་ལ་ནི་ཚུལ་ཁྲིམས་གཏམ། །
en: To people with the capacity for moral conduct who exemplify generosity they give talks on moral conduct.

source: བཟོད་པའི་དབང་པོ་ཡིན་ལ་བརྩོན་འགྲུས་སྣང་བའི་མི་ལ་བཟོད་པའི་གཏམ་སྟོན་ཏོ། །
en: “ ‘To people with the capacity for patience who exemplify vigor they give talks on patience.

source: བརྩོན་འགྲུས་དབང་པོ་ཡིན་ལ་བཟོད་པར་སྣང་བའི་མི་དེ་ལ་ནི་བརྩོན་འགྲུས་གཏམ། །
en: To people with the capacity for vigor who exemplify patience they give talks on vigor.

source: བསམ་གཏན་དབང་པོ་ཡིན་ལ་ཤེས་རབ་སྣང་བའི་མི་དེ་ལ་ནི་བསམ་གཏན་གཏམ་སྟོན་ཏོ། །
en: To people with the capacity for concentration who exemplify insight they give talks on concentration.

source: ཤེས་རབ་དབང་པོ་ཡིན་ལ་བསམ་གཏན་སྣང་བའི་མི་དེ་ལ་ནི་ཤེས་རབ་གཏམ་སྟོན་ཏོ། །
en: To people with the capacity for insight who exemplify concentration they give talks on insight.

source: གང་དག་ཉན་ཐོས་ཐེག་པའི་དབང་པོ་ཡིན་ལ་རང་རྒྱལ་སྦྱོར་བར་བྱེད་པའི་མི། །
en: “ ‘To people who have the capacity for the Śrāvaka Vehicle but apply themselves to the Pratyekabuddha Vehicle

source: དེ་དག་ལ་ནི་ཉན་ཐོས་གཏམ་སྟོན་བྱེད་ཀྱི་རང་རྒྱལ་གཏམ་ནི་སྤོང་བར་བྱེད། །
en: They will give discourses on śrāvakas but cease those about pratyekabuddhas.

source: གང་གི་དབང་པོ་རྐྱེན་གྱི་ཐེག་པར་ངེས་ལ་སྒྲ་ལ་སྦྱོར་བྱེད་གནས་བྱེད་པ། །དེ་དག་ལ་ནི་རྐྱེན་གྱི་ཐེག་པ་བསྟན་པའི་ཆོ་ག་དག་དབང་རབ་ཏུ་སྟོན། །
en: To those whose capacity is definitely for the Pratyekabuddha Vehicle but who apply themselves to words They teach the methods and faculties suited to the Dharma of the Pratyekabuddha Vehicle.

source: གང་དག་དབང་པོ་ཐེག་པ་ཆེན་པོར་ངེས་ལ་སྦྱོར་བ་དམན་པའི་མི་རྣམས་གང་ཡིན་པ། །
en: “ ‘To those whose capacity is definitely for the Great Vehicle but who resort to something inferior

source: དེ་དག་ལ་ནི་ཐུགས་རྗེ་ཆེ་ལ་གནས་པའི་རྒྱལ་བའི་ཕ་རོལ་ཕྱིན་གཏམ་སྟོན། །
en: They discourse on the transcendent perfections of the victors who abide in great compassion.

source: སྐལ་བ་ཡོད་མེད་མཁྱེན་ནས་རྒྱལ་བ་གསུང་ཞིང་ཁ་ཅིག་ལ་ནི་བཏང་སྙོམས་འཇོག །
en: Knowing who is ready and who is not, victors teach the former and are equanimous toward the latter.

source: དབང་པོ་ཡོངས་སུ་སྨིན་དང་གང་ཡང་དབང་པོ་ཡོངས་མ་སྨིན་པ་སྟོབས་བཅུས་མཁྱེན། །
en: Through the ten strengths they know which capacities have developed and which have not.

source: མི་ཡི་དབང་པོའི་སྤྱོད་པའི་རྣམ་པ་གང་དང་གང་གི་སྦྱོར་བ་ཇི་ལྟ་དང་། །
en: “ ‘They know the form of conduct of peoples’ capacities and how it is applied,

source: བསམ་པ་ཇི་ལྟ་བ་དང་རྐྱེན་གང་ཡིན་དང་ཇི་ལྟར་རྒྱུ་གང་ཡིན་པའང་མཁྱེན། །
en: Likewise their intentions and what their circumstances and their causes are,

source: དམིགས་པ་ཇི་ལྟ་བ་དང་མཐར་ཐུག་ཇི་འདྲར་གྱུར་དང་རྒྱུ་འཐུན་དེ་བཞིན་དུ། །
en: And likewise their reference points, their limits, and their corresponding causes.

source: རང་བྱུང་ཡེ་ཤེས་ཀྱིས་མཁྱེན་སྟོན་པའི་འཕྲིན་ལས་འདི་ན་ནོར་བ་ཡོད་མ་ཡིན། །
en: Knowing with spontaneous wisdom, their buddha activity of teaching is unerring.’
